Tekla Open API Reference for Tekla Structures 2025
AnalysisPartEnd.ConditionEnum Enumeration
 The conditions of the part end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ConditionEnum
Public Enumeration ConditionEnum
Members
Member name | Value | Description
CONDITION_CONNECTED | 0 |  The connected condition.
CONDITION_SUPPORTED | 1 |  The supported condition.
See Also
Reference
Tekla.Structures.Analysis Namespace